/*----------------------------------------------------------------
// Copyright (C) MickelZhang
// License:MIT
// 文件名：operator.cpp
// 文件功能描述：菜鸟教程函数部分
// 创建者：MickelZhang
// 时间：2020/12/15
// 修改人：
// 时间：
// 修改说明：
// 软件版本：VS2015
//----------------------------------------------------------------*/

/*
函数由一个函数头+一个函数主体组成：
包含：
返回类型
函数名称
参数
函数主体

//  
函数声明
函数调用
函数参数：
	传值调用 该方法把参数的实际值赋值给函数的形式参数。在这种情况下，修改函数内的形式参数对实际参数没有影响。
	指针调用 该方法把参数的地址赋值给形式参数。在函数内，该地址用于访问调用中要用到的实际参数。这意味着，修改形式参数会影响实际参数。
	引用调用 该方法把参数的引用赋值给形式参数。在函数内，该引用用于访问调用中要用到的实际参数。这意味着，修改形式参数会影响实际参数。
参数的默认值：
lambda表达式：匿名函数（不太熟悉）
	*/