/*----------------------------------------------------------------
// Copyright (C) MickelZhang
// License:MIT
// 文件名：operator.cpp
// 文件功能描述：菜鸟教程运算符，循环，判断
// 创建者：MickelZhang
// 时间：2020/12/15
// 修改人：
// 时间：
// 修改说明：
// 软件版本：VS2015
//----------------------------------------------------------------*/

//运算符
/*
算数运算符  +  -  *  /  %  ++  --
关系运算符  ==  !=   >   <   >=   <=
逻辑运算符  &&   ||   ! 
位运算符   &  |  ^异或 ` <<   >>
赋值运算符 =   +=  -=  *=    /=  %=  <<=   >>=   &=  ^=   |=    
杂项运算符  sizeof 返回变量的大小   condition ? X:Y 条件运算符 
			逗号运算符        点和箭头    cast强制转换运算符 
			&指针运算符返回变量地址    *指向一个变量

了解运算符的优先级别
*/


/*
循环有哪些：
while
for
do ...while
嵌套循环

循环控制语句：
break
continute
goto
*/

/*
判断语句：
if
if...else
嵌套if
switch
嵌套switch
*/